app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
  def index
    @posts = Post.all.order('created_at DESC')

INSERT INTO "posts" ("post", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["post", "Another post here"], ["created_at", "2021-02-09 15:40:26.888113"], ["updated_at", "2021-02-09 15:40:26.888113"], ["user_id", 1]]
---
  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save